<!DOCTYPE HTML> <html lang=""> <head> <meta charset="UTF-8"> <meta content="text/html; charset=utf-8" http-equiv="Content-Type"> <title>特别说明 · GitBook</title> <meta http-equiv="X-UA-Compatible" content="IE=edge"/> <meta name="description" content=""> <meta name="generator" content="GitBook 3.2.3"> <link rel="stylesheet" href="gitbook/style.css"> <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css"> <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css"> <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css"> <meta name="HandheldFriendly" content="true"/> <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no"> <meta name="apple-mobile-web-app-capable" content="yes"> <meta name="apple-mobile-web-app-status-bar-style" content="black"> <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png"> <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon"> <link rel="next" href="issue.html"/> <link rel="prev" href="usage.html"/> </head> <body> <div class="book"> <div class="book-summary"> <div id="book-search-input" role="search"> <input type="text" placeholder="Type to search"/> </div> <nav role="navigation"> <ul class="summary"> <li class="chapter " data-level="1.1" data-path="./"> <a href="./"> 概述 </a> </li> <li class="chapter " data-level="1.2" data-path="permission.html"> <a href="permission.html"> 权限 </a> </li> <li class="chapter " data-level="1.3" data-path="usage.html"> <a href="usage.html"> 用法 </a> </li> <li class="chapter active" data-level="1.4" data-path="explain.html"> <a href="explain.html"> 特别说明 </a> </li> <li class="chapter " data-level="1.5" data-path="issue.html"> <a href="issue.html"> 提问 </a> </li> <li class="divider"></li> <li> <a href="https://www.gitbook.com" target="blank" class="gitbook-link"> Published with GitBook </a> </li> </ul> </nav> </div> <div class="book-body"> <div class="body-inner"> <div class="book-header" role="navigation"> <h1> <i class="fa fa-circle-o-notch fa-spin"></i> <a href=".">特别说明</a> </h1> </div> <div class="page-wrapper" tabindex="-1" role="main"> <div class="page-inner"> <div id="book-search-results"> <div class="search-noresults"> <section class="normal markdown-section"> <h1 id="&#x7279;&#x522B;&#x8BF4;&#x660E;">&#x7279;&#x522B;&#x8BF4;&#x660E;</h1> <p>&#x5BF9;&#x4E8E;&#x4E2D;&#x56FD;&#x5F00;&#x53D1;&#x8005;&#x800C;&#x8A00;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x6743;&#x9650;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x4E00;&#x4E2A;&#x75DB;&#x70B9;&#xFF0C;AndPermission2.0&#x53D1;&#x5E03;&#x4E4B;&#x524D;&#x9080;&#x8BF7;&#x4E86;&#x5F88;&#x591A;&#x4E2D;&#x56FD;&#x5F00;&#x53D1;&#x8005;&#x53C2;&#x4E0E;&#x6D4B;&#x8BD5;&#xFF0C;&#x6D4B;&#x8BD5;&#x5E76;&#x517C;&#x5BB9;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x4E2D;&#x56FD;&#x4EA7;&#x624B;&#x673A;&#x3002;&#x867D;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5F88;&#x591A;&#x624B;&#x673A;&#x4E0A;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x8FD8;&#x662F;&#x4E0D;&#x5C3D;&#x5982;&#x4EBA;&#x610F;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x624B;&#x673A;&#x53EA;&#x662F;&#x5F88;&#x5C11;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x4E86;&#xFF0C;AndPermission&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x5408;&#x9002;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x517C;&#x5BB9;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p> <p>&#x56FD;&#x4EA7;&#x624B;&#x673A;&#x7684;&#x5404;&#x79CD;&#x60C5;&#x51B5;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x4E00;&#x4E00;&#x4F8B;&#x4E3E;&#x8BF4;&#x660E;&#x4E86;&#xFF0C;&#x8FD9;&#x91CC;&#x8BF4;&#x660E;&#x4E00;&#x4E9B;&#x4F7F;&#x7528;AndPermission&#x65F6;&#x51FA;&#x73B0;&#x7684;&#x7591;&#x95EE;&#x3002;</p> <p>&#x4E3A;&#x4E86;&#x517C;&#x5BB9;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x4E2D;&#x56FD;&#x4EA7;&#x624B;&#x673A;&#xFF0C;AndPermission&#x8BF7;&#x6C42;&#x6743;&#x9650;&#x7684;&#x6D41;&#x7A0B;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x4F18;&#x5316;&#xFF1A;</p> <pre><code>                        &#x53D1;&#x8D77;&#x8BF7;&#x6C42;
                            &#x2502;
            &#x250C;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2534;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2510;
            &#x2502;                               &#x2502;
    &#x4F7F;&#x7528;&#x7CFB;&#x7EDF;Api&#x5224;&#x65AD;&#x6709;&#x6743;&#x9650;            &#x4F7F;&#x7528;&#x7CFB;&#x7EDF;Api&#x5224;&#x65AD;&#x6CA1;&#x6743;&#x9650;
            &#x2502;                               &#x2502;
            &#x2502;                               &#x2502;
            &#x2502;                        &#x4F7F;&#x7528;&#x7CFB;&#x7EDF;Api&#x8BF7;&#x6C42;&#x7528;&#x6237;&#x6388;&#x6743;
            &#x2502;                               &#x2502;
            &#x2502;                               &#x2502;
            &#x2502;                            &#x7528;&#x6237;&#x6388;&#x6743;
            &#x2502;                               &#x2502;
            &#x2514;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x252C;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2518;
                            &#x2502;
                &#x6267;&#x884C;&#x6709;&#x6743;&#x9650;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x662F;&#x5426;&#x53D1;&#x751F;&#x5F02;&#x5E38;
                            &#x2502;
                        &#x56DE;&#x8C03;&#x7ED3;&#x679C;
</code></pre><p>&#x867D;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x90E8;&#x5206;&#x624B;&#x673A;&#x4E0A;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x6743;&#x9650;&#x4E0D;&#x80FD;&#x771F;&#x6B63;&#x7684;&#x517C;&#x5BB9;&#x5230;&#xFF0C;&#x6BD4;&#x5982;<em>&#x53D1;&#x9001;&#x77ED;&#x4FE1;&#x3001;</em>&#x6253;&#x7535;&#x8BDD;<em>&#x3001;</em>&#x63A5;&#x542C;/&#x6302;&#x65AD;&#x7535;&#x8BDD;<em>&#x3001;</em>&#x5B9A;&#x4F4D;<em>&#x3001;</em>&#x8EAB;&#x4F53;&#x4F20;&#x611F;&#x5668;<em>&#x3001;</em>&#x83B7;&#x53D6;&#x624B;&#x673A;&#x8D26;&#x6237;*&#x7B49;&#x7B49;&#x3002;&#x800C;&#x8FD9;&#x4E9B;&#x6743;&#x9650;&#x5F80;&#x5F80;&#x90FD;&#x662F;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x5F00;&#x53D1;&#x8005;&#x7528;&#x4E0D;&#x5230;&#x7684;&#xFF08;&#x7279;&#x6B8A;&#x5F00;&#x53D1;&#x8005;&#x9664;&#x5916;&#xFF0C;&#x4E0B;&#x9762;&#x4F1A;&#x7ED9;&#x51FA;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF09;&#x3002;</p> <p>&#x6BD4;&#x5982;<strong>&#x8EAB;&#x4F53;&#x4F20;&#x611F;&#x5668;</strong>&#x6743;&#x9650;&#xFF0C;&#x662F;&#x4F9B;&#x624B;&#x8868;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x5728;&#x5F88;&#x591A;&#x624B;&#x673A;&#x4E0A;&#x6CA1;&#x6709;&#x8EAB;&#x4F53;&#x4F20;&#x611F;&#x5668;&#x8FD9;&#x4E2A;&#x6743;&#x9650;&#x7684;&#x7BA1;&#x7406;&#x5F00;&#x5173;&#x3002;&#x8FD9;&#x4E2A;&#x6743;&#x9650;&#x4E00;&#x822C;&#x7528;&#x6765;&#x83B7;&#x53D6;&#x5FC3;&#x7387;&#x7B49;&#xFF0C;&#x5728;&#x76EE;&#x524D;&#x5E02;&#x573A;&#x4E0A;&#x6D41;&#x884C;&#x7684;&#x624B;&#x673A;&#x4E0A;&#x8FD8;&#x6D4B;&#x8BD5;&#x5230;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x5230;&#x8FD9;&#x4E2A;&#x4F20;&#x611F;&#x5668;&#x7684;&#x624B;&#x673A;&#xFF0C;&#x6240;&#x4EE5;&#x5F00;&#x53D1;&#x8005;&#x4E5F;&#x4E0D;&#x5FC5;&#x5173;&#x6CE8;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x662F;&#x624B;&#x8868;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x6743;&#x9650;&#x4E0D;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x3002;</p> <p>&#x6BD4;&#x5982;<strong>&#x5B9A;&#x4F4D;</strong>&#x6743;&#x9650;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x62D2;&#x7EDD;&#x6388;&#x6743;&#x65F6;&#xFF0C;AndPermission&#x5728;&#x68C0;&#x67E5;&#x7ED3;&#x679C;&#x65F6;&#x5185;&#x90E8;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x6267;&#x884C;&#x4E86;&#x5B9A;&#x4F4D;&#x4EE3;&#x7801;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5F88;&#x5C0F;&#x4E00;&#x90E8;&#x5206;&#x624B;&#x673A;&#x4E0A;&#xFF0C;&#x6CA1;&#x6709;&#x6743;&#x9650;&#x7684;&#x65F6;&#x5019;&#x5E76;&#x4E0D;&#x4F1A;&#x62A5;&#x9519;&#xFF0C;&#x7528;&#x7CFB;&#x7EDF;Api&#x68C0;&#x67E5;&#x7ED3;&#x679C;&#x4E5F;&#x662F;&#x6709;&#x6743;&#x9650;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5B9E;&#x5728;&#x662F;&#x6CA1;&#x529E;&#x6CD5;&#x4E86;&#x3002;&#x5F00;&#x53D1;&#x8005;&#x4E5F;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x5B9A;&#x4F4D;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x53EF;&#x80FD;&#x62FF;&#x4E0D;&#x5230;&#x5B9A;&#x4F4D;&#x4FE1;&#x606F;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x5B9A;&#x4F4D;&#x5931;&#x8D25;&#x3002;</p> <p>&#x6BD4;&#x5982;<strong>&#x7535;&#x8BDD;</strong>&#x6743;&#x9650;&#xFF0C;&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x7533;&#x8BF7;&#x65F6;&#x76F4;&#x63A5;&#x7533;&#x8BF7;&#x4E86;<strong>&#x7535;&#x8BDD;&#x6743;&#x9650;&#x7EC4;</strong>&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x7684;&#x624B;&#x673A;&#x4E2D;<code>PROCESS_OUTGOING_CALLS</code>&#x6743;&#x9650;&#x662F;&#x83B7;&#x53D6;&#x4E0D;&#x5230;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x53EA;&#x5141;&#x8BB8;&#x7CFB;&#x7EDF;App&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x6743;&#x9650;&#xFF0C;&#x6240;&#x4EE5;&#x867D;&#x7136;&#x7528;&#x6237;&#x540C;&#x610F;&#x4E86;&#x6388;&#x6743;&#xFF0C;&#x6211;&#x4EEC;&#x63A5;&#x53D7;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x8FD8;&#x662F;&#x5931;&#x8D25;&#xFF0C;&#x56E0;&#x6B64;<strong>&#x5BF9;&#x4E8E;&#x7535;&#x8BDD;&#x6743;&#x9650;&#xFF0C;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x6743;&#x9650;&#x5C31;&#x7533;&#x8BF7;&#x4EC0;&#x4E48;&#x6743;&#x9650;</strong>&#xFF0C;&#x4E0D;&#x8981;&#x7533;&#x8BF7;&#x6743;&#x9650;&#x7EC4;&#x3002;</p> <p>&#x8FD8;&#x6709;&#x4E9B;&#x6743;&#x9650;&#x4E5F;&#x6709;&#x540C;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x518D;&#x8FC7;&#x591A;&#x89E3;&#x91CA;&#xFF0C;&#x6709;&#x95EE;&#x9898;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x5728;<a href="https://github.com/yanzhenjie/AndPermission/issues" target="_blank">AndPermission/issues</a>&#x63D0;&#x95EE;&#x3002;</p> <h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2> <p>&#x6709;&#x4E00;&#x4E2A;&#x539F;&#x5219;&#x662F;<strong>&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x6743;&#x9650;&#x5C31;&#x7533;&#x8BF7;&#x4EC0;&#x4E48;&#x6743;&#x9650;</strong>&#xFF0C;&#x4E0D;&#x8981;&#x8FC7;&#x591A;&#x7684;&#x7533;&#x8BF7;&#x6743;&#x9650;&#x3002;&#x6BD4;&#x5982;<strong>&#x7535;&#x8BDD;</strong>&#x3001;<strong>&#x77ED;&#x4FE1;</strong>&#x548C;<strong>&#x8054;&#x7CFB;&#x4EBA;</strong>&#x8FD9;&#x79CD;&#x9690;&#x79C1;&#x7EA7;&#x522B;&#x6BD4;&#x8F83;&#x9AD8;&#x7684;&#x8981;&#x7279;&#x522B;&#x6CE8;&#x610F;&#xFF1B;&#x6BD4;&#x5982;<strong>&#x65E5;&#x5386;</strong>&#x3001;<strong>&#x76F8;&#x673A;</strong>&#x3001;<strong>&#x5B9A;&#x4F4D;</strong>&#x3001;<strong>&#x9EA6;&#x514B;&#x98CE;</strong>&#x548C;<strong>&#x5B58;&#x50A8;&#x7A7A;&#x95F4;</strong>&#x8FD9;&#x4E9B;&#x5E38;&#x7528;&#x4E14;&#x9690;&#x79C1;&#x7EA7;&#x522B;&#x4E0D;&#x9AD8;&#x7684;&#x6743;&#x9650;&#x53EF;&#x4EE5;&#x8BF7;&#x6C42;&#x6743;&#x9650;&#x7EC4;&#xFF0C;&#x8FD9;&#x4E9B;&#x6743;&#x9650;&#x7ECF;&#x8FC7;&#x6D4B;&#x8BD5;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#x4E5F;&#x6BD4;&#x8F83;&#x5C11;&#x3002;</p> <p>AndPermission&#x4ECE;2.0&#x7248;&#x672C;&#x5F00;&#x59CB;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x5F00;&#x53D1;&#x8005;&#x4ECE;&#x4EE3;&#x7801;&#x7684;&#x5B9E;&#x73B0;&#x4E0A;&#x7279;&#x522B;&#x5199;&#x4EC0;&#x4E48;&#x5224;&#x65AD;&#x4E86;&#xFF0C;&#x6309;&#x7167;&#x6587;&#x6863;&#x4E2D;&#x7684;&#x89C4;&#x8303;&#x4F7F;&#x7528;&#x5373;&#x53EF;&#x3002;</p> <p>&#x53E6;&#x5916;&#xFF0C;&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#xFF1A;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x6709;&#x4E9B;&#x624B;&#x673A;&#x6CA1;&#x6709;&#x6743;&#x9650;&#x65F6;&#x610F;&#x5916;&#x7684;&#x8FD4;&#x56DE;&#x6210;&#x529F;&#xFF0C;&#x800C;&#x771F;&#x6B63;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x65F6;&#x5374;&#x53D1;&#x751F;&#x5D29;&#x6E83;&#xFF0C;AndPermission&#x5728;&#x6210;&#x529F;&#x7684;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#x4E0A;&#x52A0;&#x4E86;<code>try catch</code>&#xFF0C;&#x5185;&#x90E8;&#x7684;&#x5B9E;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;</p> <pre><code>private void callbackSucceed() {
    if (mGranted != null) {
        List&lt;String&gt; permissionList = asList(mPermissions);
        try {
            mGranted.onAction(permissionList);
        } catch (Exception e) {
            if (mDenied != null) {
                mDenied.onAction(permissionList);
            }
        }
    }
}
</code></pre><p>&#x5982;&#x4E0A;&#x6240;&#x4EE5;&#xFF0C;&#x5F53;&#x5F00;&#x53D1;&#x8005;&#x6267;&#x884C;&#x6709;&#x6743;&#x9650;&#x7684;&#x4EE3;&#x7801;&#x53D1;&#x751F;&#x5F02;&#x5E38;&#x65F6;&#xFF0C;AndPermission&#x4F1A;&#x6293;&#x5230;&#x5F02;&#x5E38;&#x5E76;&#x56DE;&#x8C03;&#x5230;&#x5931;&#x8D25;&#x4E2D;&#xFF0C;&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x4F1A;&#x6293;&#x5230;&#x4EFB;&#x4F55;&#x5F02;&#x5E38;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6CA1;&#x6709;&#x6743;&#x9650;&#x65F6;&#x7684;&#x5F02;&#x5E38;&#x3002;</p> </section> </div> <div class="search-results"> <div class="has-results"> <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1> <ul class="search-results-list"></ul> </div> <div class="no-results"> <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1> </div> </div> </div> </div> </div> </div> <a href="usage.html" class="navigation navigation-prev " aria-label="Previous page: 用法"> <i class="fa fa-angle-left"></i> </a> <a href="issue.html" class="navigation navigation-next " aria-label="Next page: 提问"> <i class="fa fa-angle-right"></i> </a> </div> <script>var gitbook=gitbook||[];gitbook.push(function(){gitbook.page.hasChanged({page:{title:"特别说明",level:"1.4",depth:1,next:{title:"提问",level:"1.5",depth:1,path:"issue.md",ref:"issue.md",articles:[]},previous:{title:"用法",level:"1.3",depth:1,path:"usage.md",ref:"usage.md",articles:[]},dir:"ltr"},config:{gitbook:"*",theme:"default",variables:{},plugins:[],pluginsConfig:{highlight:{},search:{},lunr:{maxIndexSize:1000000,ignoreSpecialCharacters:false},sharing:{facebook:true,twitter:true,google:false,weibo:false,instapaper:false,vk:false,all:["facebook","google","twitter","weibo","instapaper"]},fontsettings:{theme:"white",family:"sans",size:2},"theme-default":{styles:{website:"styles/website.css",pdf:"styles/pdf.css",epub:"styles/epub.css",mobi:"styles/mobi.css",ebook:"styles/ebook.css",print:"styles/print.css"},showLevel:false}},structure:{langs:"LANGS.md",readme:"README.md",glossary:"GLOSSARY.md",summary:"SUMMARY.md"},pdf:{pageNumbers:true,fontSize:12,fontFamily:"Arial",paperSize:"a4",chapterMark:"pagebreak",pageBreaksBefore:"/",margin:{right:62,left:62,top:56,bottom:56}},styles:{website:"styles/website.css",pdf:"styles/pdf.css",epub:"styles/epub.css",mobi:"styles/mobi.css",ebook:"styles/ebook.css",print:"styles/print.css"}},file:{path:"explain.md",mtime:"2018-01-28T11:25:54.731Z",type:"markdown"},gitbook:{version:"3.2.3",time:"2018-01-28T11:43:50.386Z"},basePath:".",book:{language:""}})});</script> </div> <script src="gitbook/gitbook.js"></script> <script src="gitbook/theme.js"></script> <script src="gitbook/gitbook-plugin-search/search-engine.js"></script> <script src="gitbook/gitbook-plugin-search/search.js"></script> <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script> <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script> <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script> <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script> </body> </html>